Tekla.Structures.Catalogs.MaterialItemEnumerator
The MaterialItemEnumerator class allows to loop through the catalog material items.
The following example returns true if an item with the name S235JR has been found:
using Tekla.Structures.Catalogs;
public class Example
{
public bool Example1()
{
bool Result = false;
CatalogHandler CatalogHandler = new CatalogHandler();
if (CatalogHandler.GetConnectionStatus())
{
MaterialItemEnumerator MaterialItemEnumerator = CatalogHandler.GetMaterialItems();
while (MaterialItemEnumerator.MoveNext())
{
MaterialItem MaterialItem = MaterialItemEnumerator.Current as MaterialItem;
if (MaterialItem.MaterialName == "S235JR")
{
Result = true;
break;
}
}
}
return Result;
}
}

Tekla.Structures.Catalogs.MaterialItemEnumerator.#ctor
The constructor takes as parameter the filter for which items from the catalog
will enumerate.

Tekla.Structures.Catalogs.MaterialItemEnumerator.System#Collections#IEnumerator#Current
Implementation for the Curret property required by IEnumerator. The returned object
is always of type MaterialItem.

Tekla.Structures.Catalogs.MaterialItemEnumerator.Current
Returns a material item instance of the current element.

Tekla.Structures.Catalogs.MaterialItemEnumerator.MoveNext
Moves to the next item in the enumerator.
Returns: False on failure.

Tekla.Structures.Catalogs.MaterialItemEnumerator.Reset
Resets the enumerator to the beginning.

Tekla.Structures.Catalogs.MaterialItemEnumerator.GetSize
Returns the total amout of items.
Returns: The total amount of items.